app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "author", "price", "published_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "wrgtewr"], ["author", "weft"], ["price", 45], ["published_date", "2021-09-02 00:00:00"], ["created_at", "2021-09-28 21:29:04.658268"], ["updated_at", "2021-09-28 21:29:04.658268"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "published_date" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["published_date", "2021-09-15 00:00:00"], ["updated_at", "2021-09-28 21:28:37.870871"], ["id", 3]]